#include"date.h"
#include"time.h"
#include"datetime.h"
#include <iostream>
#include <cstdio>
#include <cstdlib>
#include <ctime>

using namespace std;

#if defined(__linux) || defined(__linux__) //Linux
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (getchar() != '\n')
		;
	cout << endl << endl;
}

#else //VS+Dev
#include <Windows.h>
#include <conio.h>
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}
#endif

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动，也不需要提交，检查时会替换（细节可能有错，如果发现请及时提出）
***************************************************************************/
void test_Date()
{
	if (1) {
		Date d1;				//1900.1.1
		Date d2(2021, 4, 17);	//2021.4.17

		cout << "测试初始化，完全正确的赋值" << endl;

		cout << "d1应该是1900.1.1， 实际为：";
		d1.show();
		cout << "d2应该是2021.4.17，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1870, 3, 15);  //2000.3.15
		Date d2(2112, 3, 4);   //2000.3.4
		Date d3(2005, 13, 15); //2005.1.15
		Date d4(2021, 4, 32);  //2021.4.1

		cout << "测试初始化，年、月、日非法" << endl;

		cout << "d1应该是1900.3.15，实际为：";
		d1.show();
		cout << "d2应该是1900.3.4， 实际为：";
		d2.show();
		cout << "d3应该是2005.1.15，实际为：";
		d3.show();
		cout << "d4应该是2021.4.1， 实际为：";
		d4.show();

		/* 多个错，按年月日顺序处理 */
		Date d5(1899, 2, 29);  //2000.2.29
		Date d6(1899, 2, 30);  //2000.2.1
		Date d7(1899, 13, 31); //2000.1.31
		Date d8(1899, 13, 32); //2000.1.1
		cout << "d5应该是1900.2.1，实际为：";
		d5.show();
		cout << "d6应该是1900.2.1， 实际为：";
		d6.show();
		cout << "d7应该是1900.1.31，实际为：";
		d7.show();
		cout << "d8应该是1900.1.1， 实际为：";
		d8.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 2, 29); //2021.2.1
		Date d2(2020, 2, 29); //2020.2.29

		cout << "测试初始化，闰年" << endl;

		cout << "d1应该是2021.2.1， 实际为：";
		d1.show();
		cout << "d2应该是2020.2.29，实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1, d2, d3; //都是2000.1.1

		cout << "测试set，带缺省值" << endl;
		d1.set(2021, 4, 17);	//2021.4.17
		d2.set(2021, 4);		//2021.4.1
		d3.set(2021);		//2021.1.1

		cout << "d1应该是2021.4.17，实际为：";
		d1.show();
		cout << "d2应该是2021.4.1， 实际为：";
		d2.show();
		cout << "d3应该是2021.1.1， 实际为：";
		d3.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17), d2(d1), d3(d1);

		cout << "测试set，部分不变" << endl;

		d1.set(2007, 0, 0);   //2007.4.17
		d2.set(0, 3, 18);   //2021.3.18
		d3.set(0, 0, 28);   //2021.4.28

		cout << "d1应该是2007.1.1，实际为：";
		d1.show();
		cout << "d2应该是1900.3.18，实际为：";
		d2.show();
		cout << "d3应该是1900.1.28，实际为：";
		d3.show();

		wait_for_enter();
	}

	if (1) {
		Date d1, d2, d3, d4;

		cout << "测试set，年、月、日非法" << endl;

		d1.set(2112, 2, 29);  //2000.2.29
		d2.set(2019, 2, 29);  //2019.2.1
		d3.set(2021, 5, 32);  //2021.5.1
		d4.set(2021, 13, 12); //2021.1.12

		cout << "d1应该是1900.2.1， 实际为：";
		d1.show();
		cout << "d2应该是2019.2.1，  实际为：";
		d2.show();
		cout << "d3应该是2021.5.1，  实际为：";
		d3.show();
		cout << "d4应该是2021.1.12， 实际为：";
		d4.show();

		/* 多个错+带缺省值，按年月日顺序处理 */
		Date d5(2020, 1, 31), d6(d5), d7(d5), d8(d5), d9(d5), d10(d5), d11(d5);  //2020.1.31

		d5.set(1899, 2, 29);  //2000.2.29
		d6.set(1899, 2, 30);  //2000.2.1
		d7.set(1899, 2, 0);   //2000.2.1
		d8.set(0, 2, 0);      //2020.2.1
		d9.set(0, 13, 32);    //2020.1.1
		d10.set(1899, 13, 31);  //2000.1.31
		d11.set(1899, 13, 32);  //2000.1.1
		cout << "d5应该是1900.2.1， 实际为：";
		d5.show();
		cout << "d6应该是1900.2.1，  实际为：";
		d6.show();
		cout << "d7应该是1900.2.1，  实际为：";
		d7.show();
		cout << "d8应该是1900.2.1，  实际为：";
		d8.show();
		cout << "d9应该1900.1.1，  实际为：";
		d9.show();
		cout << "d10应该是1900.1.31，实际为：";
		d10.show();
		cout << "d11应该是1900.1.1， 实际为：";
		d11.show();

		Date d12(2020, 2, 29), d13(2021, 3, 31);

		d12.set(2021, 0, 0); //2021.2.1
		d13.set(0, 4, 0);   //2021.4.1

		cout << "d12应该是2021.2.1， 实际为：";
		d12.show();
		cout << "d13应该是1900.4.1， 实际为：";
		d13.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17);
		int y, m, d;

		cout << "测试get" << endl;
		d1.get(y, m, d);

		cout << "应该y=2021,m=4,d=17，实际为：";
		cout << "y=" << y << ",m=" << m << ",d=" << d << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17);
		Date d2;

		cout << "测试cout" << endl;
		cout << "d1应该是2021.4.17，实际为：" << d1 << endl;
		cout << "d2应该是1900.1.1， 实际为：" << d2 << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1;

		cout << "测试cin/cout" << endl;

		cout << "请输入2021 4 17" << endl;
		cin >> d1;
		cout << "d1应该是2021.4.17，实际为：" << d1 << endl;

		cout << "请输入2020 2 29" << endl;
		cin >> d1;
		cout << "d1应该是2020.2.29，实际为：" << d1 << endl;

		cout << "请输入2021 2 29" << endl;
		cin >> d1;
		cout << "d1应该是2021.2.1，实际为：" << d1 << endl;

		cout << "请输入1899 4 10" << endl;
		cin >> d1;
		cout << "d1应该是1900.4.10，实际为：" << d1 << endl;

		cout << "请输入2021 13 10" << endl;
		cin >> d1;
		cout << "d1应该是2021.1.10，实际为：" << d1 << endl;

		cout << "请输入2021 4 31" << endl;
		cin >> d1;
		cout << "d1应该是2021.4.1，实际为：" << d1 << endl;

		cout << "请输入2112 15 34" << endl;
		cin >> d1;
		cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1(1);          //1900.1.1
		Date d2(73049);      //2099.12.31
		Date d3(-100);       //1900.1.1
		Date d4(80000);      //2099.12.31

		cout << "转换构造函数测试，包括合法及非法值" << endl;

		cout << "d1应该是1900.1.1，  实际为：";
		d1.show();
		cout << "d2应该是2099.12.31，实际为：";
		d2.show();
		cout << "d3应该是1900.1.1，  实际为：";
		d3.show();
		cout << "d4应该是1900.1.1，实际为：";
		d4.show();

		d1 = 30000;
		cout << "d1应该是1982.2.19， 实际为：";
		d1.show();

		d2 = 44302;
		cout << "d2应该是2021.4.17， 实际为：";
		d2.show();

		d2 = 0;
		cout << "d2应该是1900.1.1， 实际为：";
		d2.show();

		d2 = -1;
		cout << "d2应该是1900.1.1， 实际为：";
		d2.show();

		wait_for_enter();
	}

	if (1) {
		Date d1(1900, 1, 1);
		Date d2(2099, 12, 31);
		Date d3(1982, 2, 19);
		Date d4(2021, 4, 17);
		//Date d4(1905, 12, 29);


		cout << "类型转换函数测试，包括合法及非法值" << endl;

		cout << "d1应该是1，    实际为：" << int(d1) << endl;
		cout << "d2应该是73049，实际为：" << int(d2) << endl;
		cout << "d3应该是30000，实际为：" << int(d3) << endl;
		cout << "d4应该是44302，实际为：" << int(d4) << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17);
		Date d2;

		cout << "测试+/- n" << endl;

		d2 = d1 + 75;
		cout << "d2应该是2021.7.1，    实际为：" << d2 << endl;

		d2 = 75 + d1;
		cout << "d2应该是2021.7.1，    实际为：" << d2 << endl;

		d2 = d1 - 7;
		cout << "d2应该是2021.4.10，   实际为：" << d2 << endl;

		d1.set(2020, 2, 28);
		d2 = d1 + 3;
		cout << "d2应该是2020.3.2，    实际为：" << d2 << endl;

		d1.set(2021, 2, 28);
		d2 = d1 + 3;
		cout << "d2应该是2021.3.3，    实际为：" << d2 << endl;

		d1.set(2020, 12, 28);
		d2 = d1 + 5;
		cout << "d2应该是2021.1.2，    实际为：" << d2 << endl;

		d1.set(2021, 1, 1);
		d2 = d1 - 5;
		cout << "d2应该是2020.12.27，  实际为：" << d2 << endl;

		d1.set(2018, 12, 31);
		d2 = d1 + 366;

		cout << "d2应该是2020.1.1，    实际为：" << d2 << endl;

		d1.set(2019, 12, 31);
		d2 = d1 + 367;
		cout << "d2应该是2021.1.1，    实际为：" << d2 << endl;

		d1.set(2020, 1, 1);
		d2 = d1 - 366;
		cout << "d2应该是2018.12.31，  实际为：" << d2 << endl;

		d1.set(2021, 1, 1);
		d2 = d1 - 367;
		cout << "d2应该是2019.12.31，  实际为：" << d2 << endl;

		d1.set(1900, 1, 2);
		d2 = d1 - 10;
		cout << "d2应该是2099.12.23，    实际为：" << d2 << endl;

		d1.set(2099, 12, 30);
		d2 = d1 + 5;
		cout << "d2应该是1900.1.4，  实际为：" << d2 << endl;

		d1.set(2099, 12, 31);
		d2 = d1 + 1;
		cout << "d2应该是1900.1.1，  实际为：" << d2 << endl;

		d1.set(2199, 14, 32);
		d2 = d1 + 2;
		cout << "d2应该是1900.1.3，  实际为：" << d2 << endl;

		d1.set(1099, 120, 32);
		d2 = d1 - 2;
		cout << "d2应该是2099.12.30，  实际为：" << d2 << endl;

		d1.set(2021, 5, 9);
		d2.set(2021, 4, 17);
		cout << "d1-d2应该是22，       实际为：" << d1 - d2 << endl;

		d1.set(2020, 4, 17);
		d2.set(2019, 4, 17);
		cout << "d1-d2应该是366，      实际为：" << d1 - d2 << endl;

		d1.set(2021, 4, 17);
		d2.set(2020, 4, 17);
		cout << "d1-d2应该是365，      实际为：" << d1 - d2 << endl;

		d1.set(2021, 4, 17);
		cout << "d1+14应该是2021.5.1， 实际为：" << d1 + 14 << endl;
		cout << "14+d1应该是2021.5.1， 实际为：" << 14 + d1 << endl;
		cout << "d1-17应该是2021.3.31，实际为：" << d1 - 17 << endl;

		wait_for_enter();
	}

	if (1) {
		Date d1(2021, 4, 17);
		Date d2(2021, 3, 11);

		cout << "测试-date" << endl;
		cout << "日期差值应为37， 实际为：" << d1 - d2 << endl;

		d2.set(2021, 4, 30);
		cout << "日期差值应为-13，实际为：" << d1 - d2 << endl;

		d1.set(2020, 3, 2);
		d2.set(2020, 2, 27);
		cout << "日期差值应为4，  实际为：" << d1 - d2 << endl;

		d1.set(2021, 3, 2);
		d2.set(2021, 2, 27);
		cout << "日期差值应为3，  实际为：" << d1 - d2 << endl;

		d1.set(2021, 1, 2);
		d2.set(2020, 12, 27);
		cout << "日期差值应为6，  实际为：" << d1 - d2 << endl;

		d1.set(2020, 1, 1);
		d2.set(2018, 12, 31);
		cout << "日期差值应为366，实际为：" << d1 - d2 << endl;

		d1.set(2021, 1, 1);
		d2.set(2019, 12, 31);
		cout << "日期差值应为367，实际为：" << d1 - d2 << endl;


		wait_for_enter();
	}

	if (1) {
		Date d1, d2;

		cout << "测试++/--" << endl;

		d1.set(2021, 4, 17);
		d2 = d1++;
		cout << "d1应该是2021.4.18， 实际为：" << d1 << endl;
		cout << "d2应该是2021.4.17， 实际为：" << d2 << endl;

		d1.set(2021, 4, 17);
		d2 = ++d1;
		cout << "d1应该是2021.4.18， 实际为：" << d1 << endl;
		cout << "d2应该是2021.4.18， 实际为：" << d2 << endl;

		d1.set(2021, 5, 1);
		d2 = d1--;
		cout << "d1应该是2021.4.30， 实际为：" << d1 << endl;
		cout << "d2应该是2021.5.1，  实际为：" << d2 << endl;

		d1.set(2021, 5, 1);
		d2 = --d1;
		cout << "d1应该是2021.4.30， 实际为：" << d1 << endl;
		cout << "d2应该是2021.4.30， 实际为：" << d2 << endl;

		d1.set(2020, 12, 31);
		d2 = d1++;
		cout << "d1应该是2021.1.1，  实际为：" << d1 << endl;
		cout << "d2应该是2020.12.31，实际为：" << d2 << endl;

		d1.set(2021, 1, 1);
		d2 = d1--;
		cout << "d1应该是2020.12.31，实际为：" << d1 << endl;
		cout << "d2应该是2021.1.1，  实际为：" << d2 << endl;

		d1.set(2020, 2, 28);
		d2 = d1++;
		cout << "d1应该是2020.2.29， 实际为：" << d1 << endl;
		cout << "d2应该是2020.2.28， 实际为：" << d2 << endl;

		d1.set(2021, 2, 28);
		d2 = d1++;
		cout << "d1应该是2021.3.1，  实际为：" << d1 << endl;
		cout << "d2应该是2021.2.28， 实际为：" << d2 << endl;

		d1.set(2020, 3, 1);
		d2 = d1--;
		cout << "d1应该是2020.2.29， 实际为：" << d1 << endl;
		cout << "d2应该是2020.3.1，  实际为：" << d2 << endl;

		d1.set(2021, 3, 1);
		d2 = d1--;
		cout << "d1应该是2021.2.28， 实际为：" << d1 << endl;
		cout << "d2应该是2021.3.1，  实际为：" << d2 << endl;

		d1.set(2099, 12, 31);
		d2 = d1++;
		cout << "d1应该是2099.12.31，实际为：" << d1 << endl;
		cout << "d2应该是2099.12.31，实际为：" << d2 << endl;

		d1.set(1900, 1, 1);
		d2 = d1--;
		cout << "d1应该是1900.1.1，  实际为：" << d1 << endl;
		cout << "d2应该是1900.1.1，  实际为：" << d2 << endl;

		wait_for_enter();
	}

	if (1) {
		/* 测试比较运算符 */
		Date d1(2021, 4, 17);
		Date d2(2021, 4, 17);
		Date d3(2021, 3, 27);

		cout << "测试比较运算符" << endl;

		cout << "比较结果应为0，实际为：" << (d1 > d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 < d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 <= d2) << endl;
		cout << "比较结果应为1，实际为：" << (d1 == d2) << endl;
		cout << "比较结果应为0，实际为：" << (d1 != d2) << endl;

		cout << "比较结果应为1，实际为：" << (d1 > d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 >= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 < d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 <= d3) << endl;
		cout << "比较结果应为0，实际为：" << (d1 == d3) << endl;
		cout << "比较结果应为1，实际为：" << (d1 != d3) << endl;

		wait_for_enter();
	}

	return ;
}
/****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
****************************************************************/
void test_Time()
{
	if (1) {
		Time t1;				
		Time t2(20,2,3);	
		
		cout << "测试时间初始化，完全正确的赋值" << endl;

		cout << "t1应该是00:00:00， 实际为：";
		t1.show();
		cout << "t2应该是20:02:03，实际为：";
		t2.show();
		t2.set(9, 9, 9);
		cout << "t2应该是09:09:09，实际为：";
		t2.show();
		t2.set(14, 14, 14);
		cout << "t2应该是14:14:14，实际为：";
		t2.show();
		Time t3(t2);
		cout << "t3应该是14:14:14，实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		Time t1(-1, 90, 2);
		Time t2(24, 60, 60);
		Time t3(24,10,0);
		

		cout << "测试时间初始化，非法值" << endl;


		cout << "t1应该是00:00:02，实际为：";
		t1.show();
		cout << "t2应该是00:00:00， 实际为：";
		t2.show();
		cout << "t3应该是00:10:00，实际为：";
		t3.show();
		t3.set(10, 10, 60);
		cout << "t3应该是10:10:00， 实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		//测试set
		cout << "测试set" << endl;
		Time t1, t2, t3;

		t1.set(23, 59, 59);
		t2.set(0, 59, 0);
		t3.set(2, 0, 59);

		cout << "t1应该是23:59:59，实际为：";
		t1.show();
		cout << "t2应该是00:59:00， 实际为：";
		t2.show();
		cout << "t3应该是02:00:59， 实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		cout << "测试set，带缺省值" << endl;
		Time t1, t2, t3;

		t1.set(23, 59);
		t2.set(0);
		t3.set(2, 0, 59);

		cout << "t1应该是23:59:00，实际为：";
		t1.show();
		cout << "t2应该是00:00:00， 实际为：";
		t2.show();
		cout << "t3应该是02:00:59， 实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		cout << "测试set非法值" << endl;
		Time t1, t2, t3;

		t1.set(24,-1,100); 
		t2.set(2,60,1);  
		t3.set(-1,2,-1);  

		cout << "t1应该是00:00:00， 实际为：";
		t1.show();
		cout << "t2应该是02:00:01，  实际为：";
		t2.show();
		cout << "t3应该是00:02:00，  实际为：";
		t3.show();


		/* 多个错+带缺省值 */
		
		Time t4(25,-1,99);
		Time t5(t4), t6(t4), t7(t4), t8(t4);
		t5.set(99);
		cout << "t5应该是00:00:00， 实际为：";
		t5.show();

		t6.set(99,2);
		cout << "t6应该是00:02:00， 实际为：";
		t6.show();

		t7.set(99,100);
		cout << "t7应该是00:00:00， 实际为：";
		t7.show();

		t8.set(23,60);
		cout << "t8应该是23:00:00， 实际为：";
		t8.show();

		wait_for_enter();
	}

	if (1) {
		Time t1 = Time(1, 1, 1);
		Time t2(2, 2, 2);
		Time t3(20,28,73);
		cout << "测试cout" << endl;
		cout << "t1应该是01:01:01，实际为：" << t1 << endl;
		cout << "t2应该是02:02:02， 实际为：" << t2 << endl;
		cout << "t2应该是20:28:00， 实际为：" << t3 << endl;

		wait_for_enter();
	}

	if (0) {
		Time t1;

		cout << "测试cin/cout" << endl;

		cout << "请输入20 59 39" << endl;
		cin >> t1;
		cout << "d1应该是20:59:39，实际为：" << t1 << endl;

		cout << "请输入23 59 59" << endl;
		cin >> t1;
		cout << "d1应该是23:59:59，实际为：" << t1 << endl;

		cout << "请输入24 59 59" << endl;
		cin >> t1;
		cout << "d1应该是00:59:59，实际为：" << t1 << endl;

		cout << "请输入21 60 60" << endl;
		cin >> t1;
		cout << "d1应该是21:00:00，实际为：" << t1 << endl;

		cout << "请输入0 0 2" << endl;
		cin >> t1;
		cout << "d1应该是00:00:02，实际为：" << t1 << endl;

		wait_for_enter();
	}

	if (1) {
		Time t1(1), t2(60), t3(3600*3), t4(36610);

		cout << "转换构造函数测试，包括合法及非法值" << endl;

		cout << "t1应该是00:00:01，  实际为：";
		t1.show();
		cout << "t2应该是00:01:00，实际为：";
		t2.show();
		cout << "t3应该是03:00:00，  实际为：";
		t3.show();
		cout << "t4应该是10:10:10，实际为：";
		t4.show();

		t1 = MaxSecond+100;
		cout << "t1应该是00:00:00， 实际为：";
		t1.show();

		t2 = -100;
		cout << "t2应该是00:00:00， 实际为：";
		t2.show();

		t3 = 84203;
		cout << "t3应该是23:23:23， 实际为：";
		t3.show();

		t4 = 3600*9+59;
		cout << "t4应该是09:00:59， 实际为：";
		t4.show();

		wait_for_enter();
	}

	if (1) {
		Time t1(10, 10, 10);
		Time t2(24,24,24);
		Time t3(23, 60, 59);
		Time t4(0, 0, 1);
		

		cout << "类型转换函数测试，包括合法及非法值" << endl;

		cout << "t1应该是36610，    实际为：" << int(t1) << endl;
		cout << "t2应该是1464，实际为：" << int(t2) << endl;
		cout << "t3应该是82859，实际为：" << int(t3) << endl;
		cout << "t4应该是1，实际为：" << int(t4) << endl;

		wait_for_enter();
	}

	if (1) {
		Time t1(20, 38, 37);
		Time t2;

		cout << "测试Time +/-" << endl;

		t2 = t1 + 2083;
		cout << "t2应该是21:13:20，    实际为：" << t2 << endl;

		t2 = 9996 + t1;
		cout << "t2应该是23:25:13，    实际为：" << t2 << endl;

		t2 = -38 + t1;
		cout << "t2应该是20:37:59，    实际为：" << t2 << endl;

		t2 = t1 - 38-60*2;
		cout << "t2应该是20:35:59，   实际为：" << t2 << endl;

		t1.set(2020, 2, 28);
		t2 = t1 + 3+9*60+5*3600;
		cout << "t2应该是05:11:31，    实际为：" << t2 << endl;


		t1.set(10,99,58);
		t2 = t1 + 5;
		cout << "t2应该是10:01:03，    实际为：" << t2 << endl;

		t1.set(23,59,59);
		t2 = t1 + 2;
		cout << "t2应该是00:00:01，  实际为：" << t2 << endl;

		t1.set(19, 99, 59);
		t2 = t1 + 2+31*60+15*3600;
		cout << "t2应该是10:32:01，  实际为：" << t2 << endl;

		t1.set(20, 21, 51);
		t2 = t1 + 12 + 41 * 60 + 95 * 3600;
		cout << "t2应该是20:03:03，  实际为：" << t2 << endl;

		//-
		t1.set(23,50,1);
		t2 = t1 - (3600*7+60*15+1);
		cout << "t2应该是16:35:00，    实际为：" << t2 << endl;

		t1.set(0, 0, 0);
		t2 = t1 - (1);
		cout << "t2应该是23:59:59，    实际为：" << t2 << endl;

		t1.set(2019, 12, 31);
		t2 = t1 -(3600*10+60*13+20);
		cout << "t2应该是13:59:11，    实际为：" << t2 << endl;

		t1.set(0,0,0);
		t2 = t1 - (24*3600+60*60+60);
		cout << "t2应该是00:00:00，  实际为：" << t2 << endl;

		t1.set(20, 50, 0);
		t2 = t1 - (4 * 3600 + 3 * 60 + 60);
		cout << "t2应该是16:46:00，  实际为：" << t2 << endl;

		t1.set(20, 50, 0);
		t2 = t1 - (24 * 3600 + 53 * 60 + 30);
		cout << "t2应该是19:56:30，  实际为：" << t2 << endl;

		t1.set(0, 0, 0);
		t2 = t1 - (2);
		cout << "t2应该是23:59:58，  实际为：" << t2 << endl;


		t1.set(2021, 5, 7);
		t2.set(2021, 4, 17);
		cout << "t1-t2应该是50，       实际为：" << t1 - t2 << endl;

		t1.set(20, 4, 17);
		t2.set(18, 5, 17);
		cout << "t1-t2应该是7140，      实际为：" << t1-t2 << endl;

		t1.set(0, 4, 17);
		t2.set(23, 5, 16);
		cout << "t1-t2应该是-82859，      实际为：" << t1 - t2 << endl;

		t1.set(20, 40, 170);
		t2.set(13, 50, 16);
		cout << "t1-t2应该是"<<(7*3600-10*60-16)<<"，      实际为：" << t1 - t2 << endl;

		t1.set(100, 0, 0);
		t2.set(23, 59, 59);
		cout << "t1-t2应该是-"<<MaxSecond-1<<"，      实际为：" << t1 - t2 << endl;

		wait_for_enter();
	}

	if (1) {
		Time t1, t2;

		cout << "测试++/--" << endl;

		t1.set(20, 41, 33);
		t2 = t1++;
		cout << "t1应该是20:41:34， 实际为：" << t1 << endl;
		cout << "t2应该是20:41:33， 实际为：" << t2 << endl;

		t1.set(23,59,59);
		t2 = t1++;
		cout << "t1应该是00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是23:59:59， 实际为：" << t2 << endl;

		t1.set(12,01,59);
		t2 = t1++;
		cout << "t1应该是12:02:00， 实际为：" << t1 << endl;
		cout << "d2应该是12:01:59，  实际为：" << t2 << endl;

		t1.set(2021, 5, 59);
		t2 = ++t1;
		cout << "t1应该是00:06:00， 实际为：" << t1 << endl;
		cout << "t2应该是00:06:00， 实际为：" << t2 << endl;

		t1.set(20, 12, 31);
		t2 = ++t1;
		cout << "t1应该是20:12:32，  实际为：" << t1 << endl;
		cout << "t2应该是20:12:32，  实际为：" << t2 << endl;

		t1.set(23, 59, 59);
		t2 = ++t1;
		cout << "t1应该是00:00:00，  实际为：" << t1 << endl;
		cout << "t2应该是00:00:00，  实际为：" << t2 << endl;

		t1.set(20, 41, 33);
		t2 = t1--;
		cout << "t1应该是20:41:32， 实际为：" << t1 << endl;
		cout << "t2应该是20:41:33， 实际为：" << t2 << endl;

		t1.set(0,0,0);
		t2 = t1--;
		cout << "t1应该是00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是00:00:00， 实际为：" << t2 << endl;

		t1.set(12, 0, 0);
		t2 = t1--;
		cout << "t1应该是11:59:59， 实际为：" << t1 << endl;
		cout << "d2应该是12:00:00，  实际为：" << t2 << endl;

		t1.set(20, 41, 33);
		t2 = --t1;
		cout << "t1应该是20:41:32， 实际为：" << t1 << endl;
		cout << "t2应该是20:41:32， 实际为：" << t2 << endl;

		t1.set(0, 0, 0);
		t2 = --t1;
		cout << "t1应该是00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是00:00:00， 实际为：" << t2 << endl;

		t1.set(12, 0, 0);
		t2 = --t1;
		cout << "t1应该是11:59:59， 实际为：" << t1 << endl;
		cout << "d2应该是11:59:59，  实际为：" << t2 << endl;
		
		wait_for_enter();
	}

	if (1) {
		Time t1, t2(200,60,60), t3(0,0,0);

		cout << "测试比较运算符" << endl;

		cout << "比较结果应为0，实际为：" << (t1 > t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 >= t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 < t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 == t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 != t2) << endl;

		cout << "比较结果应为0，实际为：" << (t1 > t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 >= t3) << endl;
		cout << "比较结果应为0，实际为：" << (t1 < t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 == t3) << endl;
		cout << "比较结果应为0，实际为：" << (t1 != t3) << endl;

		t1.set(20,19,59);
		t2.set(10,59,59);
		t3.set(20,20,0);

		cout << "比较结果应为1，实际为：" << (t1 > t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 >= t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 < t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 <= t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 == t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 != t2) << endl;

		cout << "比较结果应为0，实际为：" << (t1 > t3) << endl;
		cout << "比较结果应为0，实际为：" << (t1 >= t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 < t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t3) << endl;
		cout << "比较结果应为0，实际为：" << (t1 == t3) << endl;
		cout << "比较结果应为1，实际为：" << (t1 != t3) << endl;

		wait_for_enter();
	}

}

/****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
*****************************************************************
****************************************************************/

void test_Datetime()
{
	if (1) {
		DateTime t1;
		DateTime t2(2021,10,30,20, 2, 3);

		cout << "测试时间初始化，完全正确的赋值" << endl;

		cout << "t1应该是1900-01-01 00:00:00， 实际为：";
		t1.show();
		cout << "t2应该是2021-10-30 20:02:03，实际为：";
		t2.show();
		t2.set(1998, 9, 9,9,9,9);
		cout << "t2应该是1998-09-09 09:09:09，实际为：";
		t2.show();
		t2.set(14, 14, 14,20,20,60);
		cout << "t2应该是1900-01-14 20:20:00，实际为：";
		t2.show();
		DateTime t3(t2);
		cout << "t3应该是1900-01-14 20:20:00，实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		DateTime t1(2099,2,29,-1, 90, 2);
		DateTime t2(1989,15,24,24, 60, 60);
		DateTime t3(1999,2,29,24, 10, 0);

		cout << "测试时间初始化，非法值" << endl;

		cout << "t1应该是2099-02-01 00:00:02，实际为：";
		t1.show();
		cout << "t2应该是1989-01-24 00:00:00， 实际为：";
		t2.show();
		cout << "t3应该是1999-02-01 00:10:00，实际为：";
		t3.show();
		t3.set(2100,5,2,10, 10, 60);
		cout << "t3应该是1900-05-02 10:10:00， 实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		//测试set
		cout << "测试set" << endl;
		DateTime t1, t2, t3;

		t1.set(2000,10,10,23, 59, 59);
		t2.set(0,12,31, 0,59, 0);
		t3.set(2008,8,8,8, 8, 8);

		cout << "t1应该是2000-10-10 23:59:59，实际为：";
		t1.show();
		cout << "t2应该是1900-12-31 00:59:00， 实际为：";
		t2.show();
		cout << "t3应该是2008-08-08 08:08:08， 实际为：";
		t3.show();

		wait_for_enter();
	}

	if (1) {
		cout << "测试set非法值" << endl;
		DateTime t1, t2, t3;

		t1.set(1884,1,2,24, -1, 100);
		t2.set(1981,2,30,2, 60, 1);
		t3.set(2000,8,31,-1, 2, -1);

		cout << "t1应该是1900-01-02 00:00:00， 实际为：";
		t1.show();
		cout << "t2应该是1981-02-01 02:00:01，  实际为：";
		t2.show();
		cout << "t3应该是2000-08-01 00:02:00，  实际为：";
		t3.show();
		
		wait_for_enter();
	}

	if (1) {
		DateTime t1 = DateTime(2000,1,1,1, 1, 1);
		DateTime t2(1998,11,16,2, 2, 2);
		DateTime t3(2000,5,31,20, 28, 73);
		cout << "测试cout" << endl;
		cout << "t1应该是2000-01-01 01:01:01，实际为：" << t1 << endl;
		cout << "t2应该是1998-11-16 02:02:02， 实际为：" << t2 << endl;
		cout << "t2应该是2000-05-31 20:28:00， 实际为：" << t3 << endl;

		wait_for_enter();
	}

	if (0) {
		DateTime t1;

		cout << "测试cin/cout" << endl;

		cout << "请输入2000 02 30 20 59 39" << endl;
		cin >> t1;
		cout << "d1应该是2000-02-01 20:59:39，实际为：" << t1 << endl;

		cout << "请输入1999 02 02 23 59 59" << endl;
		cin >> t1;
		cout << "d1应该是1999-02-02 23:59:59，实际为：" << t1 << endl;

		cout << "请输入3838 01 32 24 59 59" << endl;
		cin >> t1;
		cout << "d1应该是1900-01-01 00:59:59，实际为：" << t1 << endl;

		cout << "请输入2022 03 02 21 60 60" << endl;
		cin >> t1;
		cout << "d1应该是2022-03-02 21:00:00，实际为：" << t1 << endl;

		cout << "请输入2098 12 31 0 0 2" << endl;
		cin >> t1;
		cout << "d1应该是2098-12-31 00:00:02，实际为：" << t1 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime t1(1), t2(60), t3(3600 * 3), t4(36610),t5(86401);

		cout << "转换构造函数测试，包括合法及非法值" << endl;

		cout << "t1应该是1900-01-01 00:00:01，  实际为：";
		t1.show();
		cout << "t2应该是1900-01-01 00:01:00，  实际为：";
		t2.show();
		cout << "t3应该是1900-01-01 03:00:00，  实际为：";
		t3.show();
		cout << "t4应该是1900-01-01 10:10:10，  实际为：";
		t4.show();
		cout << "t5应该是1900-01-02 00:00:01，  实际为：";
		t5.show();

		t1 = MaxSecond + 100;
		cout << "t1应该是1900-01-02 00:01:40，  实际为：";
		t1.show();

		t2 = -100;
		cout << "t2应该是1900-01-01 00:00:00，  实际为：";
		t2.show();

		/******************************************************/

		t2 = (long long)73048*MaxSecond+12*3600+12*60+12;
		cout << "t2应该是2099-12-31 12:12:12，  实际为：";
		t2.show();

		t2 = (long long)MaxDateTime + 3600 * 23 + 60 * 59 + 59;
		cout << "t2应该是1900-01-01 00:00:00，  实际为：";//只有加法才会轮回，否则取默认值
		t2.show();

		t2 = (long long)30000*MaxSecond + 3600 * 23 + 60 * 59 + 59;
		cout << "t2应该是1982-02-20 23:59:59，  实际为：";
		t2.show();

		t2 = (long long)44301 * MaxSecond + 3600 * 23 + 60 * 59 + 59;
		cout << "t2应该是2021-04-17 23:59:59，  实际为：";
		t2.show();

		t2 = (long long)44302 * MaxSecond + 3600 * 23 + 60 * 59 + 59+1;
		cout << "t2应该是2021-04-19 00:00:00，  实际为：";
		t2.show();

		t2 = (long long)365 * MaxSecond + 3600 * 23 + 60 * 59 + 59 + 1;
		cout << "t2应该是1901-01-02 00:00:00，  实际为：";
		t2.show();

		t2 = (long long)(365+30) * MaxSecond + 3600 * 23 + 60 * 59 + 59 + 1;
		cout << "t2应该是1901-02-01 00:00:00，  实际为：";
		t2.show();

		wait_for_enter();
	}

	if (1) {
		DateTime t1(1901,1,1,10, 10, 10);
		DateTime t2(2021,4,18,24, 24, 24);
		DateTime t3(1982,2,20,23, 60, 59);
		DateTime t4(2888,13,2,0, 0, 1);
		DateTime t5(1902,1,31,0,5,29);
		//Date t5=2;
		//Date t6(1900, 1, 2);
		cout << "类型转换函数测试，包括合法及非法值" << endl;
		//cout << "???" << t5 <<(int)t6<< endl;
		cout << "t1应该是"<<long long(36610+365*MaxSecond)<<"，    实际为：" << long long(t1) << endl;
		cout << "t2应该是"<<long long(1464+ (long long)(44302 * (long long)MaxSecond))<<"，实际为：" << long long(t2) << endl;
		cout << "t3应该是"<<long long(82859+ (long long)(30000 * (long long)MaxSecond))<<"，实际为：" << long long(t3) << endl;
		cout << "t4应该是"<<(long long)(1+MaxSecond)<<"，实际为：" << long long(t4) << endl;
		cout << "t5应该是" << (long long)((30 + 365*2)*MaxSecond+(29+5*60)) << "，实际为：" << long long(t5) << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime t1(1900,1,1,20, 38, 37);
		DateTime t2;

		cout << "测试Time +/-" << endl;
		
		t2 = t1 + 2083LL;
		cout << "t2应该是1900-01-01 21:13:20，    实际为：" << t2 << endl;

		t2 = 9996LL + t1;
		cout << "t2应该是1900-01-01 23:25:13，    实际为：" << t2 << endl;

		t2 = ((365*3+60)*MaxSecond+ (long long)4*3600+23)+ t1;
		cout << "t2应该是1903-03-03 00:39:00，    实际为：" << t2 << endl;

		t2 = -38LL + t1;
		cout << "t2应该是1900-01-01 20:37:59，    实际为：" << t2 << endl;

		t2 = t1-(long long)(38 + 60 * 2+20*3600);
		cout << "t2应该是1900-01-01 00:35:59，   实际为：" << t2 << endl;

		t1.set(2019, 2, 28,0,0,0);
		t2 = t1 +long long( 3 + 9 * 60 + 24 * (long long)3600+365*MaxSecond);
		cout << "t2应该是2020-02-29 00:09:03，    实际为：" << t2 << endl;

		t1.set(1900,1,1,0,0,0);
		t2 = t1 + MaxDateTime;
		cout << "t2应该是1900-01-01 00:00:00，    实际为：" << t2 << endl;

		t1.set(1900, 1, 1, 0, 0, 0);
		t2 = t1 + (-1LL);
		cout << "t2应该是2099-12-31 23:59:59，    实际为：" << t2 << endl;

		t1.set(2099,12,31,23,59,59);
		t2 = t1 + 1LL;
		cout << "t2应该是1900-01-01 00:00:00，    实际为：" << t2 << endl;


		//-
		t1.set(1900,1,1,0,0,0);
		t2 = t1 - 1LL;
		cout << "t2应该是2099-12-31 23:59:59，    实际为：" << t2 << endl;

		t1.set(1900, 1, 1, 0, 0, 0);
		t2 = t1 - (long long)(24*3600+2);
		cout << "t2应该是2099-12-30 23:59:58，    实际为：" << t2 << endl;
		
		t1.set(2021,12,31,23, 50, 1);
		t2 = t1 - long long(3600 * 7 + 60 * 15 + 1);
		cout << "t2应该是2021-12-31 16:35:00，    实际为：" << t2 << endl;

		t1.set(2000,1,1,0, 0, 0);
		t2 = t1 - long long((4*365+1+31)*MaxSecond+12*3600+25*60+20);
		cout << "t2应该是1995-11-30 11:34:40，    实际为：" << t2 << endl;

		t1.set(2000, 1, 1, 0, 0, 0);
		t2 = t1 - long long(t1)-1LL;
		cout << "t2应该是2099-12-31 23:59:59，    实际为：" << t2 << endl;

		
		t1.set(2021, 5, 17,12,12,12);
		t2.set(2021, 4, 17,12,12,10);
		cout << "t1-t2应该是"<<long long(30*MaxSecond+2)<<"，       实际为：" << t1 - t2 << endl;


		t1.set(2020, 5, 17, 12, 12, 12);
		t2.set(2019, 6, 18, 13, 29, 10);
		cout << "t1-t2应该是" << long long((366-32) * MaxSecond - (3600+17*60-2)) << "，       实际为：" << t1 - t2 << endl;

		t1.set(2021, 5, 17, 12, 12, 12);
		t2.set(2020, 6, 18, 13, 29, 10);
		cout << "t1-t2应该是" << long long((365 - 32) * MaxSecond - (3600 + 17 * 60 - 2)) << "，       实际为：" << t1 - t2 << endl;

		t1.set(2099,12,31,23,59,59);
		t2.set(1900,1,1,0,0,0);
		cout << "t1-t2应该是" << long long(MaxDateTime-1) << "，       实际为：" << t1 - t2 << endl;

		t1.set(1900, 1, 1, 0, 0, 0);
		t2.set(2099, 12, 31, 23, 59, 59);
		cout << "t1-t2应该是" << long long(-MaxDateTime + 1) << "，       实际为：" << t1 - t2 << endl;

		
		wait_for_enter();
	}

	if (1) {
		DateTime t1, t2;

		cout << "测试++/--" << endl;

		t1.set(2020,15,30,20, 41, 33);
		t2 = t1++;
		cout << "t1应该是2020-01-30 20:41:34， 实际为：" << t1 << endl;
		cout << "t2应该是2020-01-30 20:41:33， 实际为：" << t2 << endl;

		t1.set(1999,12,31,23, 59, 59);
		t2 = t1++;
		cout << "t1应该是2000-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是1999-12-31 23:59:59， 实际为：" << t2 << endl;

		t1.set(2099,12,31,23,59, 59);
		t2 = t1++;
		cout << "t1应该是1900-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是2099-12-31 23:59:59，  实际为：" << t2 << endl;

		t1.set(2020, 1, 30, 20, 41, 33);
		t2 = ++t1;
		cout << "t1应该是2020-01-30 20:41:34， 实际为：" << t1 << endl;
		cout << "t2应该是2020-01-30 20:41:34， 实际为：" << t2 << endl;

		t1.set(1999, 12, 31, 23, 59, 59);
		t2 = ++t1;
		cout << "t1应该是2000-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是2000-01-01 00:00:00， 实际为：" << t2 << endl;

		t1.set(2099, 12, 31, 23, 59, 59);
		t2 = ++t1;
		cout << "t1应该是1900-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是1900-01-01 00:00:00，  实际为：" << t2 << endl;

		
		t1.set(1998,1,1,0, 0, 0);
		t2 = t1--;
		cout << "t1应该是1997-12-31 23:59:59， 实际为：" << t1 << endl;
		cout << "t2应该是1998-01-01 00:00:00， 实际为：" << t2 << endl;

		t1.set(2000,3,1,0,0,0);
		t2 = t1--;
		cout << "t1应该是2000-02-29 23:59:59， 实际为：" << t1 << endl;
		cout << "t2应该是2000-03-01 00:00:00， 实际为：" << t2 << endl;

		t1.set(1900,1,1,0,0,0);
		t2 = t1--;
		cout << "t1应该是1900-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是1900-01-01 00:00:00，  实际为：" << t2 << endl;

		t1.set(1998, 1, 1, 0, 0, 0);
		t2 = --t1;
		cout << "t1应该是1997-12-31 23:59:59， 实际为：" << t1 << endl;
		cout << "t2应该是1997-12-31 23:59:59， 实际为：" << t2 << endl;

		t1.set(2000, 3, 1, 0, 0, 0);
		t2 = --t1;
		cout << "t1应该是2000-02-29 23:59:59， 实际为：" << t1 << endl;
		cout << "t2应该是2000-02-29 23:59:59， 实际为：" << t2 << endl;

		t1.set(1900, 1, 1, 0, 0, 0);
		t2 = --t1;
		cout << "t1应该是1900-01-01 00:00:00， 实际为：" << t1 << endl;
		cout << "t2应该是1900-01-01 00:00:00，  实际为：" << t2 << endl;

		wait_for_enter();
	}

	if (1) {
		DateTime t1, t2(2021,12,39,200, 60, 60), t3(2021,12,1,0, 0, 0);

		cout << "测试比较运算符" << endl;
		
		cout << "比较结果应为0，实际为：" << (t1 > t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 >= t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 < t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 == t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 != t2) << endl;
		cout << endl;
		cout << "比较结果应为0，实际为：" << (t2 > t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 >= t3) << endl;
		cout << "比较结果应为0，实际为：" << (t2 < t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 <= t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 == t3) << endl;
		cout << "比较结果应为0，实际为：" << (t2 != t3) << endl;
		cout << endl;

		t1.set(1990,12,31,20, 19, 59);
		t2.set(1998,11,16,2, 59, 59);
		t3.set(1998,11,16,3, 0, 0);

		cout << "比较结果应为0，实际为：" << (t1 > t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 >= t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 < t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t2) << endl;
		cout << "比较结果应为0，实际为：" << (t1 == t2) << endl;
		cout << "比较结果应为1，实际为：" << (t1 != t2) << endl;
		cout << endl;

		cout << "比较结果应为0，实际为：" << (t2 > t3) << endl;
		cout << "比较结果应为0，实际为：" << (t2 >= t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 < t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 <= t3) << endl;
		cout << "比较结果应为0，实际为：" << (t2 == t3) << endl;
		cout << "比较结果应为1，实际为：" << (t2 != t3) << endl;
		cout << endl;

		t1.set(1900,1,1,0,0,0);
		t2.set(2099, 12, 31, 23, 59, 59);
		cout << "比较结果应为0，实际为：" << (t1 > t2 + 1LL) << endl;
		cout << "比较结果应为1，实际为：" << (t1 >= t2 + 1LL) << endl;
		cout << "比较结果应为0，实际为：" << (t1 < t2 + 1LL) << endl;
		cout << "比较结果应为1，实际为：" << (t1 <= t2 + 1LL) << endl;
		cout << "比较结果应为1，实际为：" << (t1 == t2 + 1LL) << endl;
		cout << "比较结果应为0，实际为：" << (t1 != t2 + 1LL) << endl;
		cout << endl;

		wait_for_enter();
	}


}

int main()
{
	if (0) {
		test_Date();
	}
	if (0) {
		test_Time();
	}
	if (1) {
		test_Datetime();
	}
	
}