/* 7772301 计算机3班 瑛姑*/
#include <iostream>
using namespace std;
int main()
{ 
	cout<<"请输入利润"<<endl;

	int i,x;
	cin>>i;
	
	if (i<=100000)
		x=i*0.1;
	else if (i<=200000)  
		x=10000+(i-100000)*0.075;					//10000=100000*0.1
	else if (i<=400000)  
		x=17500+(i-200000)*0.05;					//17500=10000+100000*0.075   下同。
	else if (i<=600000)  
		x=27500+(i-400000)*0.03;
	else if (i<=1000000)  
		x=33500+(i-600000)*0.015;
	else 
		x=39500+(i-1000000)*0.01;

	cout<<"应发奖金数："<<x<<endl;

	return 0;
}												
	


	
	